Какое будет выведено значение: let x = 5; alert( x++ ); ?
// 5 т.к. вызывается постфиксный инкремент

Чему равно такое выражение: [ ] + false - null + true ?
// NaN

Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
// 2 т.к. присвоение идет справа налево

Чему равна сумма [] + 1 + 2?
// незнаком с этим, подглядел в консоли 

Что выведет этот код: alert( "1"[0] )?
// незнаком с этим, подглядел в консоли

Чему равно 2 && 1 && null && 0 && undefined ?
// null т.к. && останавливается на первом false
Есть ли разница между выражениями? !!( a && b ) и (a && b)?
// Есть, !! приведение к логическому типу

Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
// 3 т.к. приоритет && выше, первое значение true будет 3, на нем и остановится

a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?
// незнаком с этим, подглядел в консоли

Что выведет этот код: alert( +"Infinity" ); ?
// Infinity число

Верно ли сравнение: "ёжик" > "яблоко"?
// Да, первая буква "ё" больше чем "я". Не долшел на тот момент еще до того места в учебнике. Сегодня как раз прочитал)
Чему равно 0 || "" || 2 || undefined || true || falsе ?
// 2
